src/apersci/output/templates/request-getFulfillerLocations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:getFulfillmentLocations>
         <v4:request>
             <v4:FulfillerID>{{.FulfillerID}}</v4:FulfillerID>
            <v4:Catalog>
                <v4:ManufacturerID>{{.ManufacturerID}}</v4:ManufacturerID>
                <v4:CatalogID>{{.CatalogID}}</v4:CatalogID>
            </v4:Catalog>
            <v4:Location>
                <v4:Unit>{{.Unit}}</v4:Unit>
                <v4:Radius>{{.Radius}}</v4:Radius>
                <v4:PostalCode>{{.PostalCode}}</v4:PostalCode>
                <v4:Latitude>{{.Latitude}}</v4:Latitude>
                <v4:Longitude>{{.Longitude}}</v4:Longitude>
                <v4:CountryCode>{{.CountryCode}}</v4:CountryCode>
            </v4:Location>
            <v4:MaxLocations>{{.MaxLocations}}</v4:MaxLocations>
         </v4:request>
      </v4:getFulfillmentLocations>
   </soapenv:Body>
</soapenv:Envelope>
